Show / Hide Table of Contents
Class AnchorParam
Parameter which represts the record of the anchor in IDEA MPRL
Inheritance
System.Object
MprlRecord
BoltParam
AnchorParam
Inherited Members
 BoltParam.CoordinateSystem
 BoltParam.Positions
 BoltParam.Rows
 BoltParam.Cols
 BoltParam.RowsNegative
 BoltParam.ColsNegative
 BoltParam.RowsSymmetry
 BoltParam.ColsSymmetry
 BoltParam.RowsPosition
 BoltParam.ColsPosition
 BoltParam.RowsGridType
 BoltParam.ColsGridType
 BoltParam.PolarInput
 BoltParam.Counts
 BoltParam.Radii
 BoltParam.Angles
 BoltParam.PolarPosition
 BoltParam.ShearInThread
 BoltParam.BoltInteraction
 MprlRecord.Name
 MprlRecord.TableId
 MprlRecord.ItemId
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
[Serializable]
public class AnchorParam : BoltParam
Properties
Improve this Doc   View Source
AnchorTypeData
Gets or sets the various type of anchor.
Declaration
[DataMember]
public AnchorType AnchorTypeData { get; set; }
Property Value
 Type |  Description
 AnchorType
Improve this Doc   View Source
AnchorTypeSize
Gets or sets the size of washer plate.
Declaration
[DataMember]
public double AnchorTypeSize { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Length
Gets or sets the anchor length.
Declaration
[DataMember]
public double Length { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source